sdaiPutAttrs(Sdai_instS*,System.Int32,Sdai_instS*,SdaiPrimitiveType,BTEllipsis)
\details
Sets new values to specified application instance attributes.
\param appInstance [in] An application instance that contains the attributes.
\param numberAttr  [in] A number of attributes to set their values.
\param attribute   [in] An attribute to be set.
\param valueType   [in] An attribute value type.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAT_NDEF - Attribute not defined.
* sdaiAT_NVLD - Attribute invalid.
* sdaiVT_NVLD - Value type invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance ifcWallInstance = ...;
SdaiExplicitAttr nameAttribute = sdaiGetAttrDefinition(ifcWallInstance, "name");
SdaiExplicitAttr descriptionAttribute = sdaiGetAttrDefinition(ifcWallInstance, "description");
sdaiPutAttrs(ifcWallInstance, 2, nameAttribute, sdaiSTRING, "NewName", descriptionAttribute, sdaiSTRING, "Description of a wall instance");